import {SimpleButton} from '@components';
import {COLORS, LAYOUT} from '@constants';
import BottomSheet, {BottomSheetScrollView} from '@gorhom/bottom-sheet';
import {BottomSheetMethods} from '@gorhom/bottom-sheet/lib/typescript/types';
import {FontSizeGenerator} from '@utils/fontSizeGenerator.util';
import React from 'react';
import {Text, View} from 'react-native';

import {styles} from './TACBottomSheet.styles';

interface Props {
  sheetRef: React.RefObject<BottomSheetMethods>;
  snapPoints: string[];
  acceptenceButtonHandler: () => void;
}

const TACBottomSheet = ({
  sheetRef,
  snapPoints,
  acceptenceButtonHandler,
}: Props) => {
  return (
    <BottomSheet
      ref={sheetRef}
      index={-1}
      snapPoints={snapPoints}
      enablePanDownToClose={true}
      enableDynamicSizing={false}>
      <BottomSheetScrollView contentContainerStyle={styles.container}>
        <Text style={styles.title}>წესები და პირობები</Text>
        <Text style={styles.text}>
          წინამდებარე დოკუმენტი წარმოადგენს "სინათლის მოძრაობის" (405748071)
          მობილური აპლიკაციისა და ვებსაიტის გამოყენების წესებსა და პირობებს.
          აღნიშნული დოკუმენტი წარმოადგენს ორმხრივ ვალდებულებებს შემცველ
          ხელშეკრულებას, რომელიც დგება მომხმარებელსა და "სინათლის მოძრაობას"
          შორის. (ს.ნ. 405748071) სინათლის მოძრაობა წინამდებარე სარგებლობის
          წესებსა და პირობებში, კონფიდენციალურობის პოლიტიკაში და ყველა სხვა
          სახელმძღვანელოსა და ინსტრუქციაში შემდგომში მოხსენიებული იქნება როგორც
          „ძალა”. "ძალის" მობილური აპლიკაციის გამოყენების წესები და პირობები,
          მათში შეტანილი ცვლილებები და სხვა რეგულაციები ერთობლიობაში
          წარმოადგენენ ერთიან დოკუმენტს, რომელიც განიხილება როგორც
          მომხმარებელთან დადებული ერთიანი ხელშეკრულება. აპლიკაციაში
          რეგისტრაციისას მომხმარებელი ადასტურებს, რომ ეთანხმება წინამდებარე
          დოკუმენტს, კონფიდენციალურობის პოლიტიკას და აღიარებს მათ სამართლებრივ
          ძალას. დამატებითი კითხვების, პრეტენზიებისა და მოთხოვნების შემთხვევაში,
          მომხმარებელს შეუძლია დაუკავშირდეს "ძალას" გუნდს ელექტრონული ფოსტის
          მეშვეობით, რათა მიიღოს დეტალური ინფორმაცია.
        </Text>

        <Text style={styles.subTitle}>ტერმინთა განმარტება</Text>
        <Text style={styles.text}>
          ძალა - "სინათლის მოძრაობა", რომელიც დაფუძნებულია საქართველოს
          კანონმდებლობის შესაბამისად, რეგისტრირებული შესაბამისი საიდენტიფიკაციო
          კოდით.
        </Text>
        <Text style={styles.text}>
          მომხმარებელი - ქმედუნარიანი ფიზიკური პირი, რომელიც სარგებლობს
          აპლიკაციით და მონაწილეობს მისიებში ან გამოკითხვებში.
        </Text>
        <Text style={styles.text}>
          მომხმარებლის თანხმობა - დოკუმენტის გაცნობისა და პერსონალური
          მონაცემების დამუშავების ნებართვა.
        </Text>
        <Text style={styles.text}>
          მესამე პირი - ნებისმიერი ფიზიკური ან იურიდიული პირი, მათ შორის საჯარო
          დაწესებულებები.
        </Text>
        <Text style={styles.text}>
          პირდაპირი მარკეტინგი -ტელეფონის, ელექტრონული ფოსტის ან სხვა
          ელექტრონული საშუალებით მონაცემთა სუბიექტისთვის ინფორმაციის პირდაპირი
          და უშუალო მიწოდება ფიზიკური პირის ან/და იურიდიული პირის, საქონლის,
          იდეის, მომსახურების, სამუშაოს ან/და წამოწყების, აგრეთვე საიმიჯო და
          სოციალური თემატიკისადმი ინტერესის ფორმირების, შენარჩუნების,
          რეალიზაციის ან/და მხარდაჭერის მიზნით;
        </Text>
        <Text style={styles.text}>
          რეგისტრაცია - აპლიკაციაში პირადი ანგარიშის შექმნა.
        </Text>
        <Text style={styles.text}>
          ანგარიში - მომხმარებლის პირადი გვერდი "ძალას" მობილურ აპლიკაციაში.
        </Text>
        <Text style={styles.text}>
          აპლიკაციაში ანგარიშის გახსნით მომხმარებელს ეძლევა საშუალება, მიიღოს
          მონაწილება მისიებსა და გამოკითხვებში, მიიღოს ინფორმაცია აპლიკაციაში
          განთავსებული კონტენტის შესაბამისად.
        </Text>

        <Text style={styles.subTitle}>რეგისტრაცია</Text>
        <Text style={styles.text}>
          "ძალას" აპლიკაციის გამოყენებისთვის აუცილებელია რეგისტრაციის გავლა, რაც
          მოითხოვს შემდეგი მონაცემების მითითებას:
        </Text>
        <Text style={styles.text}>სახელი, გვარი;</Text>
        <Text style={styles.text}>ელექტრონული ფოსტა;</Text>
        <Text style={styles.text}>სისტემაში შესასვლელი პაროლი.</Text>
        <Text style={styles.text}>
          მომხმარებელს შეუძლია რეგისტრაცია გაიაროს აპლიკაციის
          ჩამოტვირთვისთანავე. აპლიკაციის სრული ფუნქციონალით სარგებლობა
          შესაძლებელი ხდება რეგისტრაციისა და ავტორიზაციის გავლის შემდეგ.
        </Text>
        <Text style={styles.text}>
          სისტემაში შესვლა შესაძლებელია შემდეგი მეთოდებით:
        </Text>
        <Text style={styles.text}>Apple-ის მეშვეობით;</Text>
        <Text style={styles.text}>Google-ის მეშვეობით;</Text>

        <Text style={styles.subTitle}>მომხმარებლის ვალდებულებები</Text>
        <Text style={styles.text}>
          მომხმარებელი ადასტურებს და უზრუნველყოფს, რომ:
        </Text>
        <Text style={styles.text}>
          მოწოდებული ინფორმაცია სრულყოფილი და ზუსტია;
        </Text>
        <Text style={styles.text}>
          არ გამოიყენებს სხვა პირის მონაცემებს რეგისტრაციის მიზნით;
        </Text>
        <Text style={styles.text}>
          არ გამოიყენებს შეურაცხმყოფელ ან მორალურად არასასურველ სახელს;
        </Text>
        <Text style={styles.text}>
          არ გაავრცელებს აპლიკაციის მეშვეობით ყალბ ინფორმაციას;
        </Text>
        <Text style={styles.text}>
          არ გამოიყენებს აპლიკაციას სხვების იმიტაციის მიზნით;
        </Text>
        <Text style={styles.text}>
          არ დაარღვევს სხვა მომხმარებლის ან მესამე პირის უფლებებს;
        </Text>
        <Text style={styles.text}>
          არ გამოიყენებს პროგრამულ უზრუნველყოფას, რომელიც არღვევს აპლიკაციის
          ფუნქციონირებას;
        </Text>
        <Text style={styles.text}>
          დაიცავს საავტორო და ინტელექტუალური საკუთრების უფლებებს;
        </Text>
        <Text style={styles.text}>
          არ ეცდება მოიპოვოს სხვა მომხმარებლის ანგარიშზე წვდომა;
        </Text>
        <Text style={styles.text}>
          არ განახორციელებს აპლიკაციის ფუნქციონირების საფრთხის შემცველ
          ქმედებებს;
        </Text>
        <Text style={styles.text}>
          დაიცავს მოქმედი კანონმდებლობის მოთხოვნებს და "ძალას"
          კონფიდენციალურობის პოლიტიკას.
        </Text>

        <Text style={styles.subTitle}>პასუხისმგებლობის შეზღუდვა</Text>
        <Text style={styles.text}>
          "ძალა" მაქსიმალურად უზრუნველყოფს უსაფრთხოების მექანიზმების
          განვითარებას, თუმცა არ აგებს პასუხისმგებლობას მონაცემთა არასანქცირებულ
          წვდომაზე, მესამე პირების მიერ მიყენებულ ზიანზე ან მომსახურებაზე,
          რომელსაც ისინი სთავაზობენ მომხმარებლებს. მომხმარებელი ადასტურებს, რომ
          აპლიკაციას იყენებს საკუთარი ნებითა და პასუხისმგებლობით. "ძალა" არ
          იძლევა გარანტიას, რომ პლატფორმა ყოველთვის ხელმისაწვდომი იქნება და არ
          ექნება პროგრამული ხარვეზები. ძალა იხსნის სრულ პასუხისმგებლობას
          ნებისმიერი სახის ზიანისათვის ან/და შეფერხებისათვის, რომელიც
          შესაძლებელია გამოწვეულ იქნას მესამე პირების მონაწილეობით - ინტერნეტ
          პროვაიდერების, მობილური კომპანიების და სხვა შეფერხებული მუშაობით.
        </Text>

        <Text style={styles.subTitle}>მესამე მხარე</Text>
        <Text style={styles.text}>
          "ძალა" არ იღებს პასუხისმგებლობას იმ ვებსაიტებზე, რომლებიც შესაძლოა
          განთავსებული იყოს აპლიკაციაში გარე ბმულის სახით. აღნიშნული ვებსაიტების
          შინაარსი, წესები, პირობები და კონფიდენციალურობის პოლიტიკა შეიძლება
          განსხვავდებოდეს "ძალას" პრინციპებისგან. შესაბამისად, მომხმარებელს
          მოუწოდებს, გაეცნოს აღნიშნული ვებსაიტების გამოყენების წესებსა და
          კონფიდენციალურობის პოლიტიკას, რათა უზრუნველყოს ინფორმირებული
          გადაწყვეტილების მიღება.
        </Text>

        <Text style={styles.subTitle}>
          მარეგულირებელი კანონმდებლობა და დავების გადაწყვეტა
        </Text>
        <Text style={styles.text}>
          წინამდებარე დოკუმენტი რეგულირდება საქართველოს კანონმდებლობის
          შესაბამისად. ნებისმიერ დავას მხარეები ცდილობენ მოლაპარაკებით გადაჭრან,
          ხოლო უთანხმოების შემთხვევაში, საქმე განიხილება თბილისის საქალაქო
          სასამართლოში. დოკუმენტის რომელიმე ნაწილის ბათილად ცნობა არ გამოიწვევს
          სხვა დებულებების გაუქმებას.
        </Text>

        <Text style={styles.subTitle}>ცვლილებები და დამატებები</Text>
        <Text style={styles.text}>
          "ძალა" უფლებას იტოვებს, ნებისმიერ დროს შეიტანოს ცვლილებები ან
          დამატებები, რაც ძალაში შევა აპლიკაციაში გამოქვეყნებისთანავე.
          დოკუმენტის განახლებასთან ერთად, აპლიკაციის გამოყენება ნიშნავს
          მომხმარებლის თანხმობას ახალ პირობებზე.
        </Text>

        <Text style={styles.subTitle}>კონფიდენციალურობის პოლიტიკა</Text>
        <Text style={styles.text}>
          "ძალა" აპლიკაციის გამოყენებისას, მომხმარებელი ვალდებულია გაეცნოს
          კონფიდენციალურობის პოლიტიკას. აღნიშნული დოკუმენტი შესაძლოა პერიოდულად
          შეიცვალოს და განახლდეს, ამიტომ "ძალა" მოუწოდებს მომხმარებლებს
          რეგულარულად გადაამოწმონ კონფიდენციალურობის პირობები. მომხმარებლის მიერ
          საკუთარი სურვილით მოწოდებული პერსონალური მონაცემები ავტომატურად
          ნიშნავს უფლებამოსილების მინიჭებას "ძალას", რომ გამოიყენოს, შეინახოს და
          დაამუშავოს აღნიშნული ინფორმაცია. ამ დოკუმენტში განსაზღვრულია "ძალა"-ს
          პოლიტიკა მომხმარებელთა პერსონალური მონაცემების დამუშავებასთან,
          მიზნებთან, გამოყენებასთან და შენახვის პირობებთან დაკავშირებით. "ძალა"
          მოქმედებს საქართველოს "პერსონალურ მონაცემთა დაცვის შესახებ" კანონისა
          და მონაცემთა დაცვის ზოგადი რეგლამენტის (GDPR) მოთხოვნების შესაბამისად,
          რაც მიზნად ისახავს მომხმარებლის მონაცემთა დაცვას. აღნიშნული
          კონფიდენციალურობის პოლიტიკა წარმოადგენს "ძალა"-ს აპლიკაციის
          სარგებლობის წესების განუყოფელ ნაწილს და ორივე მხარისთვის ვალდებულებას
          შეიცავს."ძალა" დიდ მნიშვნელობას ანიჭებს მომხმარებლის
          კონფიდენციალურობას და მზადაა დაიცვას მათი პერსონალური ინფორმაცია.
          აღნიშნული პოლიტიკა განმარტავს, თუ როგორ ვაგროვებთ, ვიყენებთ და
          ვამუშავებთ მომხმარებლის მონაცემებს აპლიკაციაში "ძალა".
        </Text>

        <Text style={styles.subTitle}>ინფორმაციის შეგროვება და გამოყენება</Text>
        <Text style={styles.text}>
          ჩვენ შესაძლოა შევაგროვოთ შემდეგი სახის მონაცემები:
        </Text>
        <Text style={styles.text}>
          პირადი ინფორმაცია: მომხმარებლის ანგარიშის შექმნის ან აპლიკაციის
          გამოყენებისას შეგროვებული მონაცემები, მათ შორის სახელი, ელექტრონული
          ფოსტის მისამართი და საკონტაქტო ინფორმაცია.
        </Text>
        <Text style={styles.text}>
          მომხმარებლის აქტივობა: ინფორმაცია, რომელიც დაკავშირებულია აპლიკაციის
          გამოყენებასთან, მათ შორის მისიების შესრულება, გამოკითხვებში
          მონაწილეობა და სხვა აქტივობები.
        </Text>
        <Text style={styles.text}>
          მოწყობილობის ინფორმაცია: მომხმარებლის მოწყობილობის შესახებ მონაცემები,
          როგორიცაა მისი მოდელი, ოპერაციული სისტემა და უნიკალური
          იდენტიფიკატორები.
        </Text>
        <Text style={styles.text}>
          ანონიმური ინფორმაცია: მონაცემები, რომლებიც არ უკავშირდება კონკრეტულ
          მომხმარებელს და გამოიყენება ანალიტიკური მიზნებისთვის.
        </Text>
        <Text style={styles.text}>მონაცემთა გამოყენების მიზნები:</Text>
        <Text style={styles.text}>
          აპლიკაციის ფუნქციონირების უზრუნველყოფა: ანგარიშის მართვა, მისიების
          შესრულება, გამოკითხვებში მონაწილეობა და სხვა აქტივობების მხარდაჭერა.
        </Text>
        <Text style={styles.text}>
          მომსახურების გაუმჯობესება: აპლიკაციის მუშაობის ანალიზი და მისი
          ეფექტურობის გაზრდა.
        </Text>
        <Text style={styles.text}>
          კომუნიკაცია: მომხმარებელთან კავშირის დამყარება, განახლებების,
          შეტყობინებებისა და სხვა ინფორმაციის მიწოდებისთვის.
        </Text>

        <Text style={styles.subTitle}>მონაცემთა უსაფრთხოება</Text>
        <Text style={styles.text}>
          ჩვენ ვიღებთ შესაბამის ზომებს მომხმარებლის პერსონალური ინფორმაციის
          დასაცავად არასანქცირებული წვდომის, გამოყენებისა და გამჟღავნებისგან.
          მიუხედავად ამისა, უნდა აღინიშნოს, რომ ინტერნეტით მონაცემთა გადაცემა და
          ელექტრონული შენახვა 100%-ით უსაფრთხო არ არის.
        </Text>

        <Text style={styles.subTitle}>
          კონფიდენციალურობის პოლიტიკის განახლება
        </Text>
        <Text style={styles.text}>
          "ძალა" იტოვებს უფლებას, პერიოდულად განაახლოს კონფიდენციალურობის
          პოლიტიკა. ცვლილებების შესახებ მომხმარებლებს ეცნობებათ აპლიკაციის
          მეშვეობით ან სხვა შესაბამისი არხებით.
        </Text>

        <View style={styles.acceptenceButtonWrapper}>
          <SimpleButton
            variant="contained"
            buttonColor={COLORS.NEW_MAIN}
            textColor={COLORS.LIGHT}
            width={LAYOUT.WIDTH - 40}
            height={40}
            onPress={acceptenceButtonHandler}
            text="ვეთანხმები"
            fontSize={FontSizeGenerator(16)}
          />
        </View>
      </BottomSheetScrollView>
    </BottomSheet>
  );
};

export default TACBottomSheet;
